Autodesk.Revit.DB.CurtainGridLine.Move(Autodesk.Revit.DB.XYZ)
It is used to move unlocked type-driven grid lines or user defined grid lines.
moveVec:  The vector by which the element is to be moved.
Returns: If the element is moved successfully then the method return true, otherwise false.
Remarks: Grid line can only move within its surface and U line can only be moved along V direction. So the move distance on grid surface will be calculated from moveVec.